Австралия/src/Catalogs/POSTerminals/POSTerminals.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>POSTerminals</name>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>PettyCash</name>
    <type>
      <types>CatalogRef.CashRegisters</types>
    </type>
  </attributes>
  <attributes>
    <name>Peripherals</name>
    <type>
      <types>CatalogRef.Peripherals</types>
    </type>
  </attributes>
  <attributes>
    <name>GLAccount</name>
    <type>
      <types>ChartOfAccountsRef.PrimaryChartOfAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>UseWithoutEquipmentConnection</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>TypeOfPOS</name>
    <type>
      <types>EnumRef.TypesOfPOS</types>
    </type>
  </attributes>
  <attributes>
    <name>PaymentProcessor</name>
    <type>
      <types>CatalogRef.Counterparties</types>
    </type>
  </attributes>
  <attributes>
    <name>PaymentProcessorContract</name>
    <type>
      <types>CatalogRef.CounterpartyContracts</types>
    </type>
  </attributes>
  <attributes>
    <name>BankAccount</name>
    <type>
      <types>CatalogRef.BankAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>WithholdFeeOnPayout</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>BusinessLine</name>
    <type>
      <types>CatalogRef.LinesOfBusiness</types>
    </type>
  </attributes>
  <attributes>
    <name>Department</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>Project</name>
    <type>
      <types>CatalogRef.Projects</types>
    </type>
  </attributes>
  <attributes>
    <name>ExpenseItem</name>
    <type>
      <types>CatalogRef.IncomeAndExpenseItems</types>
    </type>
  </attributes>
  <tabularSections>
    <name>PaymentCardKinds</name>
    <attributes>
      <name>ChargeCardKind</name>
      <type>
        <types>CatalogRef.PaymentCardTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>FeePercent</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>FeeFixedPart</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Австралия/src/Enums/TypesOfPOS/TypesOfPOS.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>TypesOfPOS</name>
  <enumValues>
    <name>OnlinePayments</name>
  </enumValues>
  <enumValues>
    <name>PhysicalPOS</name>
  </enumValues>
</mdclass:Enum>

Австралия/src/Enums/ContractType/ContractType.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ContractType</name>
  <enumValues>
    <name>FromPrincipal</name>
  </enumValues>
  <enumValues>
    <name>Other</name>
  </enumValues>
  <enumValues>
    <name>SubcontractingServicesProvided</name>
  </enumValues>
  <enumValues>
    <name>SubcontractingServicesReceived</name>
  </enumValues>
  <enumValues>
    <name>WithAgent</name>
  </enumValues>
  <enumValues>
    <name>WithCustomer</name>
  </enumValues>
  <enumValues>
    <name>WithVendor</name>
  </enumValues>
  <enumValues>
    <name>PaymentProcessor</name>
  </enumValues>
</mdclass:Enum>

Австралия/src/Catalogs/CounterpartyContracts/CounterpartyContracts.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CounterpartyContracts</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.Counterparties</owners>
  <attributes>
    <name>Amount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>BusinessLine</name>
    <type>
      <types>CatalogRef.LinesOfBusiness</types>
    </type>
  </attributes>
  <attributes>
    <name>CashFlowItem</name>
    <type>
      <types>CatalogRef.CashFlowItems</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>ContactPerson</name>
    <type>
      <types>CatalogRef.ContactPersons</types>
    </type>
  </attributes>
  <attributes>
    <name>ContractDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ContractForm</name>
    <type>
      <types>CatalogRef.ContractForms</types>
    </type>
  </attributes>
  <attributes>
    <name>ContractKind</name>
    <type>
      <types>EnumRef.ContractType</types>
    </type>
  </attributes>
  <attributes>
    <name>ContractNo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ContractType</name>
    <type>
      <types>CatalogRef.CounterpartyContractTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>CounterpartyBankAccount</name>
    <type>
      <types>CatalogRef.BankAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>Department</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>DiscountMarkupKind</name>
    <type>
      <types>CatalogRef.DiscountTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>PaymentMethod</name>
    <type>
      <types>CatalogRef.PaymentMethods</types>
    </type>
  </attributes>
  <attributes>
    <name>CashAssetType</name>
    <type>
      <types>EnumRef.CashAssetTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>PriceKind</name>
    <type>
      <types>CatalogRef.PriceTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>ProvideEPD</name>
    <type>
      <types>EnumRef.VariantsOfProvidingEPD</types>
    </type>
  </attributes>
  <attributes>
    <name>Responsible</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>SettlementsCurrency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>Status</name>
    <type>
      <types>EnumRef.CounterpartyContractStatuses</types>
    </type>
  </attributes>
  <attributes>
    <name>SupplierPriceTypes</name>
    <type>
      <types>CatalogRef.SupplierPriceTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>ValidityEndDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ValidityStartDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PaymentTermsTemplate</name>
    <type>
      <types>CatalogRef.PaymentTermsTemplates</types>
    </type>
  </attributes>
  <attributes>
    <name>CreditLimit</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>OverdueLimit</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TransactionLimit</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DirectDebitMandate</name>
    <type>
      <types>CatalogRef.DirectDebitMandates</types>
    </type>
  </attributes>
  <attributes>
    <name>ShippingAddress</name>
    <type>
      <types>CatalogRef.ShippingAddresses</types>
    </type>
  </attributes>
  <attributes>
    <name>ApprovePurchaseOrders</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>LimitWithoutApproval</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>VisibleToExternalUsers</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>AdditionalAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>TextString</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>EditableParameters</name>
    <attributes>
      <name>FormRefs</name>
      <type>
        <types>CatalogRef.ContractForms</types>
      </type>
    </attributes>
    <attributes>
      <name>Presentation</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>InfobaseParameters</name>
    <attributes>
      <name>FormRefs</name>
      <type>
        <types>CatalogRef.ContractForms</types>
      </type>
    </attributes>
    <attributes>
      <name>Presentation</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Parameter</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInfo</types>
        <types>EnumRef.ContractsWithCounterpartiesTemplatesParameters</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>StagesOfPayment</name>
    <attributes>
      <name>Term</name>
      <type>
        <types>EnumRef.PaymentTerm</types>
      </type>
    </attributes>
    <attributes>
      <name>BaselineDate</name>
      <type>
        <types>EnumRef.BaselineDateForPayment</types>
      </type>
    </attributes>
    <attributes>
      <name>DuePeriod</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PaymentPercentage</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>EarlyPaymentDiscounts</name>
    <attributes>
      <name>Period</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Discount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Австралия/src/Catalogs/POSTerminals/Forms/ItemForm/Module.bsl
#Region FormEventHandlers

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	If Not ValueIsFilled(Object.Ref) And Not ValueIsFilled(Parameters.CopyingValue) Then
		
		If Not ValueIsFilled(Object.Company) Then
			SettingValue = DriveReUse.GetValueByDefaultUser(Users.CurrentUser(), "MainCompany");
			If ValueIsFilled(SettingValue) Then
				Object.Company = SettingValue;
			Else
				Object.Company = Catalogs.Companies.MainCompany;
			EndIf;
		EndIf;
		
		UsePeripherals = GetFunctionalOption("UsePeripherals");
		
		If Object.TypeOfPOS = Enums.TypesOfPOS.OnlinePayments Or Not UsePeripherals Then
			Object.UseWithoutEquipmentConnection = True;
		EndIf;
		
		Object.ExpenseItem = Catalogs.DefaultIncomeAndExpenseItems.GetItem("OtherExpenses");
		
	EndIf;
	
	If Parameters.Key.IsEmpty() Then
		OnReadOnCreateAtServer(Object);
	EndIf;
	
	ReadCounterpartyAttributes(CounterpartyAttributes, Object.PaymentProcessor);
	
	SetBankAccountChoiceParameters(False);
	
	NativeLanguagesSupportServer.OnCreateAtServer(ThisObject, Object);
	
EndProcedure

&AtClient
Procedure BeforeWrite(Cancel, WriteParameters)

	If IsBlankString(Object.Description) Then
		Object.Description = MakeAutoDescription();
	EndIf;
	
EndProcedure

&AtClient
Procedure OnOpen(Cancel)
	
	SetVisibleAndEnabled();
	MakeAutoDescription();
	
EndProcedure

&AtClient
Procedure NotificationProcessing(EventName, Parameter, Source)
	
	If EventName = "GLAccountChangedPOSTerminals" Then
		Object.GLAccount = Parameter.GLAccount;
		Modified = True;
	ElsIf EventName = "Write_Counterparty" 
		And ValueIsFilled(Parameter)
		And Object.PaymentProcessor = Parameter Then
		
		ReadCounterpartyAttributes(CounterpartyAttributes, Parameter);
		SetVisibleAndEnabled();
		
	EndIf;
	
EndProcedure

&AtServer
Procedure OnReadAtServer(CurrentObject)
	
	OnReadOnCreateAtServer(CurrentObject);
	
	NativeLanguagesSupportServer.OnReadPresentationsAtServer(Object);
	
EndProcedure

&AtServer
Procedure BeforeWriteAtServer(Cancel, CurrentObject, WriteParameters)
	
	NativeLanguagesSupportServer.BeforeWriteAtServer(CurrentObject);
	
EndProcedure

&AtServer
Procedure AfterWriteAtServer(CurrentObject, WriteParameters)
	
	NativeLanguagesSupportServer.OnReadPresentationsAtServer(Object);
	
EndProcedure

#EndRegion

#Region FormHeaderItemsEventHandlers

&AtClient
Procedure TypeOfPOSOnChange(Item)
	
	If TypeOfPOS <> Object.TypeOfPOS Then
		
		If Object.TypeOfPOS = PredefinedValue("Enum.TypesOfPOS.OnlinePayments") Then
			TypeOfPOSOnChangeServer();
		EndIf;
		
		SetVisibleAndEnabled();
		
		TypeOfPOS = Object.TypeOfPOS;
		
	EndIf;
	
EndProcedure

&AtClient
Procedure CompanyOnChange(Item)
	
	If Company <> Object.Company Then
		
		If Object.TypeOfPOS = PredefinedValue("Enum.TypesOfPOS.OnlinePayments") Then
			CompanyOnChangeAtServer();
		EndIf;
		Company = Object.Company;
		
	Else
		
		Object.PettyCash = PettyCash;
		Object.PaymentProcessorContract = PaymentProcessorContract;
		Object.BankAccount = BankAccount;
		
	EndIf;
	
EndProcedure

&AtClient
Procedure UseWithoutEquipmentConnectionOnChange(Item)
	
	SetVisibleAndEnabled();
	
EndProcedure

&AtClient
Procedure PettyCashOnChange(Item)
	
	MakeAutoDescription();
	
EndProcedure

&AtClient
Procedure PaymentProcessorOnChange(Item)
	
	If PaymentProcessor <> Object.PaymentProcessor Then
		
		PaymentProcessorOnChangeAtServer();
		SetVisibleAndEnabled();
		PaymentProcessor = Object.PaymentProcessor;
		
	Else
		
		Object.PaymentProcessorContract = PaymentProcessorContract;
		
	EndIf;
	
EndProcedure

&AtClient
Procedure PaymentProcessorContractOnChange(Item)
	
	PaymentProcessorContractOnChangeAtServer();
	PaymentProcessorContract = Object.PaymentProcessorContract;
	
EndProcedure

&AtClient
Procedure Attachable_Open(Item, StandardProcessing)
	
	NativeLanguagesSupportClient.OnOpen(ThisObject, Object, Item, StandardProcessing);
	
EndProcedure

#EndRegion

#Region PaymentCardKindsFormTableItemsEventHandlers

&AtClient
Procedure PaymentCardKindsFeePercentOnChange(Item)
	
	CurRow = Items.PaymentCardKinds.CurrentData;
	
	If CurRow.FeePercent > 100 Then
		CurRow.FeePercent = 100;
	EndIf;
	
EndProcedure

#EndRegion

#Region Private

&AtServer
Procedure SetBankAccountChoiceParameters(ClearNonValidValue = True)
	
	If ValueIsFilled(Object.PaymentProcessorContract) Then
		ContractCurrency = Common.ObjectAttributeValue(Object.PaymentProcessorContract, "SettlementsCurrency");
	Else
		ContractCurrency = Catalogs.Currencies.EmptyRef();
	EndIf;
	
	If ClearNonValidValue And ValueIsFilled(Object.BankAccount) Then
		BankAccountCurrency = Common.ObjectAttributeValue(Object.BankAccount, "CashCurrency");
		If ContractCurrency <> BankAccountCurrency Then
			Object.BankAccount = "";
			BankAccount = "";
		EndIf;
	EndIf;
	
	CP_Array = New Array;
	CP_Array.Add(New ChoiceParameter("Filter.CashCurrency", ContractCurrency));
	Items.BankAccount.ChoiceParameters = New FixedArray(CP_Array);
	
EndProcedure

&AtServer
Procedure TypeOfPOSOnChangeServer()
	
	SetDefaultPaymentProcessorContract();
	SetBankAccountChoiceParameters();
	
EndProcedure

&AtServer
Procedure PaymentProcessorContractOnChangeAtServer()
	
	SetBankAccountChoiceParameters();
	
EndProcedure

&AtServer
Procedure PaymentProcessorOnChangeAtServer()
	
	ReadCounterpartyAttributes(CounterpartyAttributes, Object.PaymentProcessor);
	SetDefaultPaymentProcessorContract();
	SetBankAccountChoiceParameters();
	
EndProcedure

&AtServer
Procedure CompanyOnChangeAtServer()
	
	SetDefaultPaymentProcessorContract();
	SetBankAccountChoiceParameters();
	
EndProcedure

&AtServer
Function SetDefaultPaymentProcessorContract()
	
	ContractTypes = New ValueList;
	ContractTypes.Add(Enums.ContractType.PaymentProcessor);
	
	DefaultContract = Catalogs.CounterpartyContracts.GetDefaultContractByCompanyContractKind(Object.PaymentProcessor,
		Object.Company, ContractTypes);
	
	Object.PaymentProcessorContract = DefaultContract;
	PaymentProcessorContract = DefaultContract;
	
EndFunction

&AtServer
Procedure OnReadOnCreateAtServer(Object)
	
	TypeOfPOS = Object.TypeOfPOS;
	Company = Object.Company;
	PettyCash = Object.PettyCash;
	PaymentProcessor = Object.PaymentProcessor;
	PaymentProcessorContract = Object.PaymentProcessorContract;
	BankAccount = Object.BankAccount;
	
EndProcedure

&AtClient
Procedure SetVisibleAndEnabled()
	
	IsOnlinePayment = (Object.TypeOfPOS = PredefinedValue("Enum.TypesOfPOS.OnlinePayments"));
	
	Items.PettyCash.Visible = Not IsOnlinePayment;
	Items.GroupPeripherals.Visible = Not IsOnlinePayment;
	
	Items.PaymentProcessor.Visible = IsOnlinePayment;
	Items.PaymentProcessorContract.Visible = IsOnlinePayment;
	Items.BankAccount.Visible = IsOnlinePayment;
	Items.WithholdFeeOnPayout.Visible = IsOnlinePayment;
	Items.BusinessLine.Visible = IsOnlinePayment;
	Items.Department.Visible = IsOnlinePayment;
	Items.Project.Visible = IsOnlinePayment;
	Items.PaymentCardKindsFeePercent.Visible = IsOnlinePayment;
	Items.PaymentCardKindsFeeFixedPart.Visible = IsOnlinePayment;
	
	If Object.UseWithoutEquipmentConnection And Not UsePeripherals Then
		Items.UseWithoutEquipmentConnection.Enabled = False;
	EndIf;
	Items.Peripherals.Enabled = Not Object.UseWithoutEquipmentConnection;
	
	Items.PaymentProcessorContract.Visible = CounterpartyAttributes.DoOperationsByContracts;
	
EndProcedure

&AtServerNoContext
Procedure ReadCounterpartyAttributes(StructureAttributes, Val Counterparty)
	
	DriveServer.ReadCounterpartyAttributes(StructureAttributes, Counterparty, "DoOperationsByContracts");
	
EndProcedure

&AtClient
Function MakeAutoDescription()
	
	Items.Description.ChoiceList.Clear();
	
	DescriptionString = NStr("en = 'POS terminal (%1)'; ru = 'Эквайринговый терминал (%1)';pl = 'Terminal POS (%1)';es_ES = 'Terminal TPV (%1)';es_CO = 'Terminal TPV (%1)';tr = 'POS terminali (%1)';it = 'Terminale POS (%1)';de = 'POS-Terminal (%1)'");
	
	If Object.TypeOfPOS = PredefinedValue("Enum.TypesOfPOS.PhysicalPOS") Then
		DescriptionParameter = Object.PettyCash;
	ElsIf Object.TypeOfPOS = PredefinedValue("Enum.TypesOfPOS.OnlinePayments") Then
		DescriptionParameter = Object.PaymentProcessor;
	Else
		DescriptionParameter = "";
	EndIf;
	
	DescriptionString = StringFunctionsClientServer.SubstituteParametersToString(DescriptionString, DescriptionParameter);
	DescriptionString = Left(DescriptionString, 100);
	Items.Description.ChoiceList.Add(DescriptionString);
	
	Return DescriptionString;

EndFunction

#EndRegion
